%%%-------------------------------------------------------------------
%%% @author Administrator
%%% @copyright (C) 2018, <COMPANY>
%%% @doc
%%%
%%% @end
%%% Created : 26. 六月 2018 13:34
%%%-------------------------------------------------------------------

-module(lib_math).
-auth("cw").

-compile(export_all).

%% 向上取整
get_ceil(X) ->
	T = trunc(X),
	if
		X - T == 0 -> T;
		true ->
			if
				X > 0 -> T + 1;
				true -> T
			end
	end.

%% 向下取整
floor(X) ->
	T = trunc(X),
	if
		X - T == 0 -> T;
		true ->
			if
				X > 0 -> T;
				true -> T-1
			end
	end.




%% -----------------------------------------------------------------------------
%% internal function
%% -----------------------------------------------------------------------------













